app/views/questions/show.html.erb

<ul>
  <% @question.answers.each do |answer| %>
---
SELECT "answers".* FROM "answers" WHERE "answers"."question_id" = $1  [["question_id", "247"]]