app/controllers/answers_controller.rb

  def create
    @answer = Answer.new(answer_params)
    @answer.question_id = @question.id

    if @answer.save
---
INSERT INTO "answers" ("description", "question_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"

  def update
    Answer.where(question_id: params[:question_id]).update_all(best: false)
    Answer.find(params[:id]).update(best: true)
---
SELECT  "answers".* FROM "answers" WHERE "answers"."question_id" = $1  ORDER BY "answers"."id" ASC LIMIT 1  [["question_id", "1"]]
UPDATE "answers" SET "best" = $1, "updated_at" = $2 WHERE "answers"."id" = $3  [["best", "f"], ["updated_at", "2015-03-25 22:41:33.229722"], ["id", 1]]
SELECT  "answers".* FROM "answers" WHERE "answers"."id" = $1 LIMIT 1  [["id", 1]]