app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions"  ORDER BY "questions"."created_at" DESC LIMIT 1
---
  def index
    @questions = Question.order(:created_at)

INSERT INTO "questions" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @question = Question.new(question_params)
    @question.user_id = session[:user_id]

    if @question.save